<string> 헤더 파일은 문자열(string)을 다루기 위한 여러 가지 기능을 제공합니다. 이 헤더 파일에는 다음과 같은 기능이 포함되어 있습니다.

std::string 클래스: 문자열을 저장하고 조작하기 위한 클래스입니다.
std::getline() 함수: std::cin으로부터 문자열을 입력받을 때 사용하는 함수입니다.
문자열 조작 함수: 문자열을 조작하기 위한 다양한 함수가 포함되어 있습니다.
    예를 들어, std::string::size() 함수는 >>문자열의 길이를 반환<<하고,
             std::string::append() 함수는 >>문자열을 덧붙입<<니다.
문자열 검색 함수: 문자열에서 >>특정 문자나 문자열을 검색하는 함수<<가 포함되어 있습니다.
    예를 들어, std::string::find() 함수는 문자열에서 특정 문자열을 검색하고, 첫 번째 등장 위치를 반환합니다.
문자열 처리 함수들 : >>문자열 비교, 검색, 변환 등을 수행할 수 있는 함수<<들이 포함되어 있습니다.
    예를 들어 std::string::compare(), std::string::find(), std::stoi() 등이 있습니다.
문자열 변환 함수: >>문자열을 다른 데이터 형식으로 변환<<하는 함수가 포함되어 있습니다.
    예를 들어, std::stoi() 함수는 문자열을 정수로 변환합니다
문자열 조작 함수들 : 문자열을 조작하는 함수들이 포함되어 있습니다.
    예를 들어 std::string::append(), std::string::substr(), std::string::replace() 등이 있습니다.
문자열 입력/출력 함수들 : 문자열을 입력하고 출력하는 함수들이 포함되어 있습니다.
    예를 들어 std::getline()과 같은 함수가 있습니다.
문자열 클래스의 멤버 변수와 함수들 : std::string 클래스 자체가 제공하는 멤버 변수와 함수들도 매우 다양합니다.
    예를 들어 std::string::size()나 std::string::length()는 문자열의 길이를 반환하며, std::string::empty()는 문자열이 비어있는지 여부를 반환합니다.